// Домашняя задача 38:
// Задайте массив вещественных чисел. 
// Найдите разницу между максимальным и минимальным элементов массива.
// [3 7 22 2 78] -> 76

int[] array = new int[5];
for(int i=0; i<5; i++)
{
    array[i] = Console.WriteLine()
}